app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."id" ASC
---
    def index
        @books = Book.order(:id)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "published_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["published_date", "2020-09-09"], ["updated_at", "2020-09-18 03:01:33.111130"], ["id", 2]]
---
    def update
        # get an existing object, then save the object to process the form
        @book = Book.find(params[:id])

        if @book.update_attributes(book_params)